zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_fmc.h
/** @defgroup FMC_ECC_Access_Mode FMC Sequencer and BCH access mode
  * @{
  */
#define FMC_NAND_ECC_ACCESS_MODE_READ           ((uint32_t)0x00000000)
#define FMC_NAND_ECC_ACCESS_MODE_WRITE          (FMC_PCR_WEN)
/**
  * @}
  */

/** @defgroup FMC_ECC_Sector_Size FMC ECC Sector Size
  * @{
  */
#define FMC_NAND_ECC_SECTOR_SIZE_256BYTE          (0U << FMC_PCR_ECCSS_Pos)
#define FMC_NAND_ECC_SECTOR_SIZE_512BYTE          (1U << FMC_PCR_ECCSS_Pos)
#define FMC_NAND_ECC_SECTOR_SIZE_1024BYTE         (2U << FMC_PCR_ECCSS_Pos)
#define FMC_NAND_ECC_SECTOR_SIZE_2048BYTE         (3U << FMC_PCR_ECCSS_Pos)
#define FMC_NAND_ECC_SECTOR_SIZE_4096BYTE         (4U << FMC_PCR_ECCSS_Pos)
#define FMC_NAND_ECC_SECTOR_SIZE_8192BYTE         (5U << FMC_PCR_ECCSS_Pos)
/**
  * @}
  */

/**
  * @}
  */


/** @defgroup FMC_LL_Interrupt_definition FMC Low Layer Interrupt definition
  * @{
  */
#define FMC_IT_RISING_EDGE                      (0x00000001U)
#define FMC_IT_LEVEL                            (0x00000002U)
#define FMC_IT_FALLING_EDGE                     (0x00000004U)
/**
  * @}
  */

/** @defgroup FMC_LL_Flag_definition FMC Low Layer Flag definition
  * @{
  */
#define FMC_FLAG_RISING_EDGE                    (0x00000001U)
#define FMC_FLAG_LEVEL                          (0x00000002U)
#define FMC_FLAG_FALLING_EDGE                   (0x00000004U)
#define FMC_FLAG_FEMPT                          (0x00000040U)
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/** @defgroup FMC_LL_Private_Macros FMC_LL  Private Macros
  * @{
  */
/**
  * @brief  Enable the FMC Peripheral.
  * @retval None
  */
#define __FMC_ENABLE()  (FMC_Bank1_R->BTCR[0] |= FMC_BCRx_FMCEN)

/**
  * @brief  Disable the FMC Peripheral.
  * @retval None
  */
#define __FMC_DISABLE()  (FMC_Bank1_R->BTCR[0] &= ~FMC_BCRx_FMCEN)
/** @defgroup FMC_LL_NOR_Macros FMC NOR/SRAM Macros
  * @brief macros to handle NOR device enable/disable and read/write operations
  * @{
  */

/**
  * @brief  Enable the NORSRAM device access.
  * @param  __INSTANCE__ FMC_NORSRAM Instance
  * @param  __BANK__ FMC_NORSRAM Bank
  * @retval None
  */
#define __FMC_NORSRAM_ENABLE(__INSTANCE__, __BANK__)  ((__INSTANCE__)->BTCR[(__BANK__)]\
                                                       |= FMC_BCRx_MBKEN)

/**
  * @brief  Disable the NORSRAM device access.
  * @param  __INSTANCE__ FMC_NORSRAM Instance
  * @param  __BANK__ FMC_NORSRAM Bank
  * @retval None
  */
#define __FMC_NORSRAM_DISABLE(__INSTANCE__, __BANK__) ((__INSTANCE__)->BTCR[(__BANK__)]\
                                                       &= ~FMC_BCRx_MBKEN)

/**
  * @}
  */

/** @defgroup FMC_LL_NAND_Macros FMC NAND Macros
  *  @brief macros to handle NAND device enable/disable
  *  @{
  */

/**
  * @brief  Enable the NAND device access.
  * @param  __INSTANCE__ FMC_NAND Instance
  * @retval None
  */
#define __FMC_NAND_ENABLE(__INSTANCE__)  ((__INSTANCE__)->PCR |= FMC_PCR_PBKEN)

/**
  * @brief  Disable the NAND device access.
  * @param  __INSTANCE__ FMC_NAND Instance
  * @param  __BANK__     FMC_NAND Bank
  * @retval None
  */
#define __FMC_NAND_DISABLE(__INSTANCE__, __BANK__) CLEAR_BIT((__INSTANCE__)->PCR, FMC_PCR_PBKEN)

/**
  * @}
  */

/** @defgroup FMC_LL_NAND_Interrupt FMC NAND Interrupt
  * @brief macros to handle NAND interrupts
  * @{
  */

/**
  * @brief  Enable the NAND device interrupt.
  * @param  __INSTANCE__  FMC_NAND instance
  * @param  __INTERRUPT__ FMC_NAND interrupt
  *         This parameter can be any combination of the following values:
  *            @arg FMC_IT_RISING_EDGE: Interrupt rising edge.
  *            @arg FMC_IT_LEVEL: Interrupt level.
  *            @arg FMC_IT_FALLING_EDGE: Interrupt falling edge.
  * @retval None
  */
#define __FMC_NAND_ENABLE_IT(__INSTANCE__, __INTERRUPT__)  ((__INSTANCE__)->IER |= (__INTERRUPT__))

/**
  * @brief  Disable the NAND device interrupt.
  * @param  __INSTANCE__  FMC_NAND Instance
  * @param  __INTERRUPT__ FMC_NAND interrupt
  *         This parameter can be any combination of the following values:
  *            @arg FMC_IT_RISING_EDGE: Interrupt rising edge.
  *            @arg FMC_IT_LEVEL: Interrupt level.
  *            @arg FMC_IT_FALLING_EDGE: Interrupt falling edge.
  * @retval None
  */
#define __FMC_NAND_DISABLE_IT(__INSTANCE__, __INTERRUPT__)  ((__INSTANCE__)->IER &= ~(__INTERRUPT__))

/**
  * @brief  Get flag status of the NAND device.
  * @param  __INSTANCE__ FMC_NAND Instance
  * @param  __BANK__     FMC_NAND Bank
  * @param  __FLAG__     FMC_NAND flag
  *         This parameter can be any combination of the following values:
  *            @arg FMC_FLAG_RISING_EDGE: Interrupt rising edge flag.
  *            @arg FMC_FLAG_LEVEL: Interrupt level edge flag.
  *            @arg FMC_FLAG_FALLING_EDGE: Interrupt falling edge flag.
  *            @arg FMC_FLAG_FEMPT: FIFO empty flag.
  * @retval The state of FLAG (SET or RESET).
  */
#define __FMC_NAND_GET_FLAG(__INSTANCE__, __BANK__, __FLAG__)  (((__INSTANCE__)->ISR &(__FLAG__)) == (__FLAG__))

/**
  * @brief  Clear flag status of the NAND device.
  * @param  __INSTANCE__ FMC_NAND Instance
  * @param  __FLAG__     FMC_NAND flag
  *         This parameter can be any combination of the following values:
  *            @arg FMC_FLAG_RISING_EDGE: Interrupt rising edge flag.
  *            @arg FMC_FLAG_LEVEL: Interrupt level edge flag.
  *            @arg FMC_FLAG_FALLING_EDGE: Interrupt falling edge flag.
  *            @arg FMC_FLAG_FEMPT: FIFO empty flag.
  * @retval None
  */
#define __FMC_NAND_CLEAR_FLAG(__INSTANCE__, __FLAG__)  ((__INSTANCE__)->ICR |= (__FLAG__))

/**
  * @brief  Disable the NAND ECC.
  * @param  __INSTANCE__ FMC_NAND Instance
  * @param  __BANK__     FMC_NAND Bank
  * @retval None
  */
#define __FMC_NAND_DISABLE_ECC(__INSTANCE__, __BANK__) CLEAR_BIT((__INSTANCE__)->PCR, FMC_PCR_ECCEN)

/**
  * @brief  Enable the NAND ECC.
  * @param  __INSTANCE__ FMC_NAND Instance
  * @param  __BANK__     FMC_NAND Bank
  * @retval None
  */
#define __FMC_NAND_ENABLE_ECC(__INSTANCE__, __BANK__) SET_BIT((__INSTANCE__)->PCR, FMC_PCR_ECCEN)

/**
  * @brief  Check if Hamming ECC is ready by testing FMC_SR_NWRF and FMC_SR_PEF flags of the NAND device.
  * @param  __INSTANCE__ FMC_NAND Instance
  * @retval The state of FMC_SR_NWRF and FMC_SR_PEF flags (SET if both are set, RESET otherwise).
  */
#define __FMC_NAND_IS_ECC_HAMMING_READY(__INSTANCE__)  (((__INSTANCE__)->SR & \
                                                         (FMC_SR_NWRF | FMC_SR_PEF)) == (FMC_SR_NWRF | FMC_SR_PEF))

/**
  * @brief  Set the ECC algorithm.
  * @param  __INSTANCE__ FMC_NAND Instance
  * @param  __ALGORITHM__ Either FMC_NAND_ECC_ALGO_HAMMING or FMC_NAND_ECC_ALGO_BCH
  * @retval None
  */
#define __FMC_NAND_SET_ECC_ALGORITHM(__INSTANCE__, __ALGORITHM__) \
  (MODIFY_REG((__INSTANCE__)->PCR, FMC_PCR_ECCALG, __ALGORITHM__))

/**
  * @brief  Set the ECC BCH mode (4-bit or 8-bit).
  * @param  __INSTANCE__ FMC_NAND Instance
  * @param  __MODE__ Either FMC_NAND_BCH_4BIT or FMC_NAND_BCH_8BIT
  * @retval None
  */
#define __FMC_NAND_SET_BCH_MODE(__INSTANCE__, __MODE__)  (MODIFY_REG((__INSTANCE__)->PCR, FMC_PCR_BCHECC, __MODE__))

/**
  * @brief  Set the ECC access mode for the sequencer and BCH.
  * @param  __INSTANCE__ FMC_NAND Instance
  * @param  __MODE__ Either FMC_NAND_ECC_ACCESS_MODE_READ or FMC_NAND_ECC_ACCESS_MODE_WRITE
  * @retval None
  */
#define __FMC_NAND_SET_ECC_ACCESS_MODE(__INSTANCE__, __MODE__)  (MODIFY_REG((__INSTANCE__)->PCR, FMC_PCR_WEN,__MODE__))

/**
  * @brief  Check if BCH ECC is ready from the encoder by testing FMC_BCHISR_EPBRF flag of the NAND device.
  * @param  __INSTANCE__ FMC_NAND Instance
  * @retval The state of FMC_BCHISR_EPBRF flags (SET or RESET).
  */
#define __FMC_NAND_IS_ECC_BCH_ENCODER_READY(__INSTANCE__)  (((__INSTANCE__)->BCHISR & \
                                                             FMC_BCHISR_EPBRF) == FMC_BCHISR_EPBRF)

/**
  * @brief  Check if BCH ECC is ready from the decoder by testing DERF flag of the NAND device.
  * @param  __INSTANCE__ FMC_NAND Instance
  * @retval The state of DERF flags (SET or RESET).
  */
#define __FMC_NAND_IS_ECC_BCH_DECODER_READY(__INSTANCE__)  (((__INSTANCE__)->BCHISR & \
                                                             FMC_BCHISR_DERF) == FMC_BCHISR_DERF)

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup FMC_LL_Private_Functions FMC LL Private Functions
  *  @{
  */

/** @defgroup FMC_LL_NORSRAM  NOR SRAM
  *  @{
  */
/** @defgroup FMC_LL_NORSRAM_Private_Functions_Group1 NOR SRAM Initialization/de-initialization functions
  *  @{
  */
HAL_StatusTypeDef  FMC_NORSRAM_Init(FMC_NORSRAM_TypeDef *Device,
                                    FMC_NORSRAM_InitTypeDef *Init);
HAL_StatusTypeDef  FMC_NORSRAM_Timing_Init(FMC_NORSRAM_TypeDef *Device,
                                           FMC_NORSRAM_TimingTypeDef *Timing, uint32_t Bank);
HAL_StatusTypeDef  FMC_NORSRAM_Extended_Timing_Init(FMC_NORSRAM_EXTENDED_TypeDef *Device,
                                                    FMC_NORSRAM_TimingTypeDef *Timing, uint32_t Bank,
                                                    uint32_t ExtendedMode);
HAL_StatusTypeDef  FMC_NORSRAM_DeInit(FMC_NORSRAM_TypeDef *Device,
                                      FMC_NORSRAM_EXTENDED_TypeDef *ExDevice, uint32_t Bank);
/**
  * @}
  */

/** @defgroup FMC_LL_NORSRAM_Private_Functions_Group2 NOR SRAM Control functions
  *  @{
  */
HAL_StatusTypeDef  FMC_NORSRAM_WriteOperation_Enable(FMC_NORSRAM_TypeDef *Device, uint32_t Bank);
HAL_StatusTypeDef  FMC_NORSRAM_WriteOperation_Disable(FMC_NORSRAM_TypeDef *Device, uint32_t Bank);
/**
  * @}
  */
/**
  * @}
  */

/** @defgroup FMC_LL_NAND NAND
  *  @{
  */
/** @defgroup FMC_LL_NAND_Private_Functions_Group1 NAND Initialization/de-initialization functions
  *  @{
  */
HAL_StatusTypeDef  FMC_NAND_Init(FMC_NAND_TypeDef *Device, FMC_NAND_InitTypeDef *Init);
HAL_StatusTypeDef  FMC_NAND_CommonSpace_Timing_Init(FMC_NAND_TypeDef *Device,
                                                    FMC_NAND_PCC_TimingTypeDef *Timing, uint32_t Bank);
HAL_StatusTypeDef  FMC_NAND_AttributeSpace_Timing_Init(FMC_NAND_TypeDef *Device,
                                                       FMC_NAND_PCC_TimingTypeDef *Timing, uint32_t Bank);
HAL_StatusTypeDef  FMC_NAND_DeInit(FMC_NAND_TypeDef *Device, uint32_t Bank);
/**
  * @}
  */

/** @defgroup FMC_LL_NAND_Private_Functions_Group2 NAND Hamming error correction functions
  *  @{
  */
HAL_StatusTypeDef  FMC_NAND_ECC_Enable(FMC_NAND_TypeDef *Device, uint32_t Bank);
HAL_StatusTypeDef  FMC_NAND_ECC_Disable(FMC_NAND_TypeDef *Device, uint32_t Bank);
HAL_StatusTypeDef  FMC_NAND_GetECC(FMC_NAND_TypeDef *Device, uint32_t *ECCval, uint32_t Bank, uint32_t Timeout);
HAL_StatusTypeDef  FMC_NAND_ECC_SetAlgorithm(FMC_NAND_TypeDef *Device, uint32_t Algorithm);
HAL_StatusTypeDef  FMC_NAND_ECC_SetBCHMode(FMC_NAND_TypeDef *Device, uint32_t Mode);
HAL_StatusTypeDef  FMC_NAND_ECC_SetAccessMode(FMC_NAND_TypeDef *Device, uint32_t Mode);
HAL_StatusTypeDef  FMC_NAND_ECC_GetBCH(FMC_NAND_TypeDef *Device, uint32_t *ECCval, uint32_t Timeout);
HAL_StatusTypeDef  FMC_NAND_ECC_GetBCHResult(FMC_NAND_TypeDef *Device, uint32_t *BCHDSRx,
                                                      uint32_t Timeout);
void               FMC_NAND_ECC_DecodeBCHResult(const uint32_t *BCHDSRx, uint16_t *Positions,
                                                      int32_t *ErrorCount);
/**
  * @}
  */
/**
  * @}
  */



/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP13xx_LL_FMC_H */
